0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.06;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    enclosure
    {
        type            fixedValue;
        value           $internalField;
    }

    "(prop1|prop2|prop3|prop4)"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    body
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
// ***************************** tensor-VTOL-2024 ************************** //
// ******************************** tensor.com ***************************** //