system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.31 -0.31 -0.21)
    (0.31 -0.31 -0.21)
    (0.31 0.31 -0.21)
    (-0.31 0.31 -0.21)

    (-0.31 -0.31 0.16)
    (0.31 -0.31 0.16)
    (0.31 0.31 0.16)
    (-0.31 0.31 0.16)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 80 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (2 6 5 1)
            (0 3 2 1)
            (0 4 7 3)
            (4 5 6 7)
            (1 5 4 0)
        );
    }

);


// ************************************************************************* //
// ***************************** tensor-VTOL-2024 ************************** //
// ******************************** tensor.com ***************************** //