system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    body.stl { type triSurfaceMesh; name body;}
    prop1.stl { type triSurfaceMesh; name prop1;}
    prop2.stl { type triSurfaceMesh; name prop2;}
    prop3.stl { type triSurfaceMesh; name prop3;}
    prop4.stl { type triSurfaceMesh; name prop4;}
     rotating1.stl { type triSurfaceMesh; name rotating1;}
     rotating2.stl { type triSurfaceMesh; name rotating2;}
     rotating3.stl { type triSurfaceMesh; name rotating3;}
     rotating4.stl { type triSurfaceMesh; name rotating4;}
     enclosure.stl { type triSurfaceMesh; name enclosure;}
     refinementBox { type searchableBox; min (-0.1 -0.08 -0.04); max (0.1 0.08 0.06); }
}


castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 0;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 2;

    features
    (
        { file        "prop1.eMesh"; level       2;}
        { file        "prop2.eMesh"; level       2;}
        { file        "prop3.eMesh"; level       2;}
        { file        "prop4.eMesh"; level       2;}

        { file        "rotating1.eMesh"; level    1;}
        { file        "rotating2.eMesh"; level    1;}
        { file        "rotating3.eMesh"; level    1;}
        { file        "rotating4.eMesh"; level    1;}

        { file        "enclosure.eMesh"; level   0;}
    );


    refinementSurfaces
    {
        rotating1 { level (2 2); faceType boundary; cellZone rotating1; faceZone rotating1; cellZoneInside  inside; }
        rotating2 { level (2 2); faceType boundary; cellZone rotating2; faceZone rotating2; cellZoneInside  inside; }
        rotating3 { level (2 2); faceType boundary; cellZone rotating3; faceZone rotating3; cellZoneInside  inside; }
        rotating4 { level (2 2); faceType boundary; cellZone rotating4; faceZone rotating4; cellZoneInside  inside; }

        prop1 { level (2 3);}
        prop2 { level (2 3);}
        prop3 { level (2 3);}
        prop4 { level (2 3);}
        
        enclosure { level (0 0);}
        body { level (0 1);}
    }

    resolveFeatureAngle 30;
    refinementRegions
    {
        rotating1 { mode inside; levels ((1E15 2));}
        rotating2 { mode inside; levels ((1E15 2));}
        rotating3 { mode inside; levels ((1E15 2));}
        rotating4 { mode inside; levels ((1E15 2));}
	    refinementBox { mode inside; levels ((1E15 1)); }
    }

    locationInMesh (0.29 0.29 0.14);
    allowFreeStandingZoneFaces false;
}


snapControls
{
    nSmoothPatch 3;
    tolerance 4.0;
    nSolveIter 300;
    nRelaxIter 5;
        nFeatureSnapIter 10;
        implicitFeatureSnap true;
        explicitFeatureSnap false;
        multiRegionFeatureSnap true;
}

addLayersControls
{

    relativeSizes true;
    layers
    {
    }
    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality -1; 
    minArea -1;
    minTwist 0.01;
    minDeterminant 0.001;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
    relaxed
    {
        maxNonOrtho 75;
    }
}

mergeTolerance 1e-6;


// ************************************************************************* //
// ***************************** tensor-VTOL-2024 ************************** //
// ******************************** tensor.com ***************************** //