system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

prop1.stl { extractionMethod extractFromSurface; includedAngle 150; trimFeatures {minElem 10;}}
prop2.stl { extractionMethod extractFromSurface; includedAngle 150; trimFeatures {minElem 10;}}
prop3.stl { extractionMethod extractFromSurface; includedAngle 150; trimFeatures {minElem 10;}}
prop4.stl { extractionMethod extractFromSurface; includedAngle 150; trimFeatures {minElem 10;}}
rotating1.stl { extractionMethod extractFromSurface; includedAngle 150; trimFeatures {minElem 10;}}
rotating2.stl { extractionMethod extractFromSurface; includedAngle 150; trimFeatures {minElem 10;}}
rotating3.stl { extractionMethod extractFromSurface; includedAngle 150; trimFeatures {minElem 10;}}
rotating4.stl { extractionMethod extractFromSurface; includedAngle 150; trimFeatures {minElem 10;}}

enclosure.stl { extractionMethod extractFromSurface; includedAngle 150; trimFeatures {minElem 10;}}

body.stl { extractionMethod extractFromSurface; includedAngle 150; trimFeatures {minElem 10;}}


// ************************************************************************* //
// *********************** tensor-VTOL-2024 ******************************** //
// *************************** pttensor.com ******************************** //
